Documents/гф_УстановкаСнятиеЛимита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_УстановкаСнятиеЛимита</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гф_ВидыОперацийЛимита</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_СтатусыЛимитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЛимита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыЛимитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/гф_ВидыОперацийЛимита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>гф_ВидыОперацийЛимита</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СнятиеЛимита</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаЛимита</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/гф_УстановкаСнятиеЛимита/Forms/гф_ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы   
// #wortmann { 
// Параметры:
// Отказ, СтандартнаяОбработка 
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Партнер") Тогда
		Партнер = Параметры.Партнер;		
		УстановитьОтборПоПартнеру();
	КонецЕсли;                                           
	
КонецПроцедуры
// } #wortmann 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницыФормыОсновная 
// #wortmann {
// Замена запроса для динамического списка
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&НаСервере
Процедура ИсторияНаСервере()
	Список.ТекстЗапроса = ЗаменитьТекстЗапросаВДинамическомСписке();
КонецПроцедуры
// } #wortmann 

// #wortmann {
// Отбор формы списка по партеру,для команды
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&НаСервере
Процедура УстановитьОтборПоПартнеру()

ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.
Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
ЭлементОтбора.ПравоеЗначение = Партнер;		

КонецПроцедуры
// } #wortmann

// #wortmann { 
// Параметры:
//Команда 
// Обработка команды по созданию документа с видом операции установка лимита
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&НаКлиенте
Процедура СоздатьСнятиеЛимита(Команда) 
	
	ОперацияУстановкаЛимита = ПредопределенноеЗначение("Перечисление.гф_ВидыОперацийЛимита.СнятиеЛимита");
	ЭлементыОтбора = Новый Структура("ВидОперации", ОперацияУстановкаЛимита );
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Документ.гф_УстановкаСнятиеЛимита.Форма.гф_ФормаДокумента", ПараметрыФормы, ЭтотОбъект); 
	
КонецПроцедуры
// } #wortmann

 // #wortmann {
 // Параметры:
// Команда 
// Обработка команды по созданию документа с видом операции снятие лимита
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&НаКлиенте
Процедура СоздатьУстановкаЛимита(Команда)
	
	ОперацияУстановкаЛимита = ПредопределенноеЗначение("Перечисление.гф_ВидыОперацийЛимита.УстановкаЛимита");
	ЭлементыОтбора = Новый Структура("ВидОперации", ОперацияУстановкаЛимита );
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Документ.гф_УстановкаСнятиеЛимита.Форма.гф_ФормаДокумента", ПараметрыФормы, ЭтотОбъект); 
	
КонецПроцедуры
// } #wortmann

// #wortmann {
// Параметры:
// Команда 
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&НаКлиенте
Процедура История(Команда)
	ИсторияНаСервере();
КонецПроцедуры
// } #wortmann

// #wortmann {
// Замена запроса для динамического списка
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05  
// Возвращаемое значение:
// Запрос.Текс - текст запроса
&НаСервере
Функция ЗаменитьТекстЗапросаВДинамическомСписке() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гф_УстановкаСнятиеЛимита.Ссылка КАК Ссылка,
		|	гф_УстановкаСнятиеЛимита.Номер КАК Номер,
		|	гф_УстановкаСнятиеЛимита.Дата КАК Дата,
		|	гф_УстановкаСнятиеЛимита.Проведен КАК Проведен,
		|	гф_УстановкаСнятиеЛимита.ВидОперации КАК ВидОперации,
		|	гф_УстановкаСнятиеЛимита.Статус КАК Статус,
		|	гф_УстановкаСнятиеЛимита.Контрагент КАК Контрагент,
		|	гф_УстановкаСнятиеЛимита.Организация КАК Организация,
		|	гф_УстановкаСнятиеЛимита.ВидЛимита КАК ВидЛимита,
		|	гф_УстановкаСнятиеЛимита.Сумма КАК Сумма,
		|	гф_УстановкаСнятиеЛимита.Комментарий КАК Комментарий,
		|	гф_УстановкаСнятиеЛимита.Ответственный КАК Ответственный
		|ИЗ
		|	Документ.гф_УстановкаСнятиеЛимита КАК гф_УстановкаСнятиеЛимита";
	
	Возврат Запрос.Текст;
	
КонецФункции
// } #wortmann

#КонецОбласти
